def quote_of_the_Day():
    quote = ["Если хотите по вечерам ложиться спать с чувством \
удовлетворения, просыпайтесь каждое утро с чувством решимости",
    "Если хочешь изменить свою жизнь, будь готов \
первым делом начать что-нибудь делать по-другому!", 
    "Каждый раз, выбирая простое решение вместо правильного, \
вы формируете свою личность и все больше становитесь человеком, \
который предпочитает то, что легко и просто, а не то, что правильно",
    "Если хочешь изменить свою жизнь, будь готов первым \
делом начать что-нибудь делать по-другому!",
    "Самое лучшее приключение, которое может случиться с человеком, \
— это жить жизнью своей мечты",
    "Внешний мир всегда был и будет отражением нашего внутреннего мира. \
А успех всегда параллелен уровню нашего развития как личностей. \
Если мы ежедневно и целенаправленно не выделяем время на то, \
чтобы развить в себе того человека, который сможет создать жизнь \
нашей мечты, нам будет очень-очень трудно достичь желанного результата",
    "С одной стороны, мы все хотим быть счастливыми. С другой — все мы знаем, \
что именно делает нас счастливыми. Но мы этого не делаем. Почему? Очень \
просто. Мы для этого слишком заняты. Слишком заняты для чего? Слишком \
заняты для того, чтобы быть счастливыми",
    "Ваш успех крайне редко превышает уровень вашего личностного развития, \
ибо вы привлекаете успех, только став человеком, способным его привлекать",
    "Есть только два способа прожить жизнь. Первый — так, будто чудес вообще \
не бывает. Второй — будто все в жизни чудо",
    "Жизнь начинается там, где заканчивается зона комфорта",
    "Cейчас я делаю все, что в моих силах, но в то же время я могу и лучше",
    "Всегда помните, что то, что у вас есть сейчас, вы получили в результате \
того, каким человеком были, но только от вас зависит, кем и каким вы \
решите стать начиная с этой секунды",
    "Самое лучшее приключение, которое может случиться с человеком, — \
это жить жизнью своей мечты",
    "Запомните эту истину: настоящий момент значит гораздо больше, чем \
любой другой момент жизни, потому что именно то, что вы делаете \
сейчас и сегодня, определяет, каким человеком вы становитесь. \
А то, кем вы становитесь, в свою очередь определяет качество и \
направление вашей жизни в целом",
    "Наш успех крайне редко превышает уровень нашего личностного \
развития, потому что мы привлекаем успех, становясь тем, кем становимся",
    "Успешные люди не рождаются успешными. Они становятся такими благодаря \
приобретению привычки делать то, что очень не нравится делать неудачникам. \
Успешным людям и самим далеко не всегда это нравится, однако они берут себя \
в руки и делают, что надо",
    "Ищите людей, которые верят в вас, восхищаются вами и могут помочь прийти \
туда, куда вы стремитесь",
    "Если хотите по вечерам ложиться спать с чувством удовлетворения, \
просыпайтесь каждое утро с чувством решимости",
    "Всегда помните, что то, кем вы становитесь, гораздо важнее, чем то, \
что вы делаете, однако же именно ваши поступки определяют, каким человеком \
вы становитесь",
    "Исследования ученых показали, что любой человек фактически представляет \
собой нечто среднее из пяти человек, с которыми он проводит больше \
всего времени",
    "Как вы делаете что-то, так вы делаете все",
    "Чтобы серьезно изменить свою жизнь, необходимо испытать либо вдохновение, \
либо отчаяние",
    "Не забывайте, что момент, когда вы берете полную ответственность за все \
в своей жизни — это также момент, когда вы заявляете свое право что угодно \
в ней менять",
    "СМЕНИТЕ КРИТИКУ НА СОПЕРЕЖИВАНИЕ, ВОЗВЫСЬТЕ ЖАЛОБЫ ДО БЛАГОДАРНОСТИ И \
ОБМЕНЯЙТЕ СТРАХ НА ЛЮБОВЬ",
    "Не позволяйте чужим страхам, неуверенности и ограничивающим установкам \
снижать ваши возможности",
    "Внешний мир есть отражение нашего внутреннего мира",
    "Обычные люди верят только в возможное. Экстраординарные люди \
представляют себе не то, что возможно, а то, что невозможно. И, визуализируя \
невозможное, начинают видеть его как возможное",
    "Итак, вы можете использовать аффирмации и начать перепрограммировать \
себя так, чтобы стать более уверенным и успешным во всем, что вы делаете. \
Для этого надо просто постоянно повторять себе, кем вы хотите быть, чего \
хотите достичь и как собираетесь это сделать. Если твердить это достаточно \
часто, ваше подсознание начнет верить в то, что вы ему говорите, и будет \
действовать в соответствии с этими словами, и в конце концов все это \
воплотится в вашей реальности",
    "Тишина — один из лучших инструментов, позволяющих немедленно уменьшить \
стресс, одновременно повысив осознанность, и достичь ясности, что непременно \
поможет вам каждый день сохранять фокус на поставленных целях, приоритетах и \
самом важном в вашей жизни",
    "За один час молчания можно узнать больше, чем из всех книг, \
прочитанных за год",
    "Чтобы легко просыпаться по утрам, человеку нужно помнить, что его \
первой мыслью при пробуждении, как правило, будет последняя мысль перед \
укладыванием в постель",
    "Отсутствие необходимости давать отчет в своих делах",
    "Успешные люди не рождаются успешными. Они становятся такими благодаря \
приобретению привычки делать то, что очень не нравится делать неудачникам. \
Успешным людям и самим далеко не всегда это нравится, однако они берут себя \
в руки и делают, что надо",
    "Как вы делаете что-то, так вы делаете все",
    "Привычки — это регулярно повторяемые поступки и шаблоны поведения, \
причем, как правило, неосознанные. Понимаете вы это или нет, но вашу жизнь \
строили и впредь будут строить ваши привычки. И если вы их не контролируете, \
они непременно начнут управлять вами",
    "Отчаяние — сырье для радикальных изменений. Надеяться на спасение может \
только тот, кто сумел оставить в прошлом все, во что он верил прежде"
    ]

# pg 3

    from random import randrange

    return quote[randrange(0, len(quote)-1)]
    
