# taro value

arcans = ["Fool", "Magician", "High_Priestess", "Empress", "Emperor",
    "Hierophant", "Lovers", "Chariot", "Justice", "Hermit", "Wheel_off_Fortune", 
    "Strength", "Hanged_Man", "Death", "Temperance", "Devil", "Tower", 
    "Star", "Moon", "Sun", "Judgement", "World"]

# 0
Fool = [
    ["Шут"],
    ["Свобода выбора, новые возможности и горизонты",
    "Большой потенциал, легкость, энергичность, оптимизм",
    "Принятие важных решений, новый этап в жизни",
    "Неорганизованность, расточительность, риск"],
    ["Безрассудство, глупость, безумие, беспомощность",
    "Склонность к риску и авантюризму",
    "Ошибки, неверно принятое важное решение",
    "Беспечность, неорганизованность, легкомысленность",
    "Нестабильность, колебания"],
    ["Найдите себе что то новенькое, попробуйте сыграть в новую игру"],
    ["Избегайте любой неупорядоченности и не будьте слишком легкомысленны"]
    ]

# 1        
Magician = [
    ["Маг"],
    ["Сила воли, целеустремленность, решительность, возможность планировать и действовать",
    "Знание, вдохновение, умение убеждать",
    "Уверенность в себе, хорошие связи"],
    ["Несобранность в мыслях и делах, суетливость, нерешительность",
    "Пустые фантазии и неосуществимые планы",
    "Тщеславие, пустая самоуверенность, психический недуг",
    "Потеря контроля над ситуацией"],
    ["Поверьте в свои способности, в возможность справиться с предстоящим делом"],
    ["Не думайте, что для достижения вашей цели все средства хороши"]
    ]

# 2
High_Priestess = [
    ["Жрица"],
    ["Духовная мудрость, скрытое знание, понимание ситуации",
    "Дар предвидения, интуиция",
    "Знание, образование, ясность в мыслях, способность обучаться и обучать",
    "Намеки и тайны, умалчивание, секреты, неизвестность в будущем",
    "Намеки и тайны, умалчивание, секреты, неизвестность в будущем"],
    ["Пустая самоуверенность, невежество, пассивность",
    "Отсутствие интуиции и дара предвидения, нереализованные возможности",
    "Сильные противоречивые эмоции, необдуманные поступки",
    "Склонность к компромиссу, слабость, колебания, неспособность разобраться в ситуации"],
    ]
        
# 3
Empress = [
    ["Императрица"],
    ["Успешная реализация планов, материальные блага",
    "Взаимная любовь, брак и материнство, здоровье, физическая и духовная гармония",
    "Созидание, творчество, личный прогресс"],
    ["Упадок сил, нерешительность в чувствах и действиях",
    "Угасание чувств, раздражительность, суета, неприятности в семье",
    "Отсутствие прогресса в делах, материальные проблемы"],
    ["Ищите плодородную почву, будьте открыты росту и переменам"],
    ["Избегайте излишеств, но в то же время не упускайте шансов"]
    ]
    
# 4
Emperor = [
    ["Император"],
    ["Успешная реализация задуманного, стабильность",
    "Мужское начало, власть, могущество и сила, целеустремленность",
    "Мудрость, лидерские качества, авторитет",
    "Защита и покровительство"],
    ["Жесткий контроль, давление с чьей-то стороны",
    "Бессмысленное упрямство, бунтарство, нестабильность эмоций",
    "Проблемы с врагами",
    "Бессилие изменить ситуацию, неудачи, препятствия",
    "Задуманному не дано реализоваться"],
    ["Осуществляйте свои планы твердо и последовательно",
    "Излишние педантизм и рассудительность могут загубить любое живое дело и чувство"]
    ]
    
# 5
Hierophant = [
    ["Жрец"],
    ["Соблюдение норм и правил, приобщение к какой-либо организации или группе",
    "Традиционный подход к решению проблемы, авторитет, власть",
    "Мудрое руководство, помощь или совет",
    "Законный брак, общность интересов",
    "Поиск истины, философские и религиозные поиски, воодушевление"],
    ["Излишний консерватизм, тщеславие, нетерпимость, догматизм",
    "Потеря авторитета, слабость и склонность к компромиссам",
    "Выход за рамки, несоблюдение установленных правил",
    "Независимость, нестандартный способ решения задачи"],
    ["Во всем ищите смысл, и посвящайте себя лишь осмысленному труду"],
    ["Не гордитесь достигнутым, чтобы не стать агрессивным фанатиком, который всегда прав"]
    ]
    
# 6
Lovers = [
    ["Влюбленные"],
    ["Любовь, влечение, гармония отношений",
    "Успешное сотрудничество, крепкая дружба",
    "Новая любовь в будущем",
    "Здоровье, красота",
    "Нелегкий, но правильный выбор",
    "Борьба или испытание, которое закончится вашей победой"],
    ["Неправильный выбор, скороспелое решение",
    "Разочарование в отношениях, разлука, конфликты и проблемы в личной жизни",
    "Проблемы в отношениях с окружающими, недостаток взаимопонимания",
    "Смятение, расстройства, проблемы со здоровьем",
    "Неприятности, неосуществимые планы"],
    ["Найти общий язык с другим человеком, чтобы вместе стремиться к общей цели"],
    ["Не считайте хорошее начало залогом успешного конца"]
    ]
    
# 7
Chariot = [
    ["Колесница"],
    ["Победа, признание, успешное преодоление испытаний",
    "Целеустремленность, сила воли, уверенность в себе",
    "Триумф разума, контроль над своими эмоциями и желаниями",
    "Справедливое возмездие",
    "Контроль над ситуацией, умение обернуть ситуацию себе на пользу"],
    ["Неорганизованность, отсутствие самоконтроля",
    "Непреодолимые препятствия на пути",
    "Провал, поражение",
    "Стихийный мятеж, ссора, неконтролируемые негативные эмоции"],
    ["Если у тебя есть дело, берись за него, не откладывая и не раздумывая"],
    ["Не умеешь - не берись"]
    ]
    
# 8
Justice = [
    ["Справедливость"],
    ["Позитивное решение, награда",
    "Честность, объективность, уважение, авторитет, равновесие",
    "Правосудие, правота, выигрыш в споре или судебном процессе",
    "Профессионализм, соблюдение установленных правил и процедур"],
    ["Несправедливость, суровость, жесткость, фанатизм, злоупотребление правосудием",
    "Проигрыш в споре или судебном процессе, юридические сложности и препятствия",
    "Дисгармония, внутренний разлад, предубеждение"],
    ["Подойти к делу трезво и объективно, осознавая свою ответственность за принятие решения"],
    ["Избегать предвзятости и веры в непогрешимость собственного суждения"]
    ]
    
# 9
Hermit = [
    ["Отшельник"],
    ["Мудрость, знание, опыт, умение решить любую поставленную задачу",
    "Самопознание, духовный поиск, духовная самореализация",
    "Осторожность, благоразумие, самоограничение",
    "Уединение, скрытая истина"],
    ["Пренебрежение мудрой мыслью или советом, недоверие, самонадеянность",
    "Необоснованная предосторожность, перестраховка, страх, ошибки",
    "Одиночество, изоляция, ложные идеалы",
    "Обман, скрытность, мошенничество"],
    ["Оставаться самим собой, не торопить события"],
    ["Не изолировать себя от внешнего мира, не озлобляться, не становиться бирюком-одиночкой"]
    ]
    
#10
Wheel_off_Fortune = [
    ["Колесо Фортуны"],
    ["Везение, удача, счастливое стечение обстоятельств, награда",
    "Перемены в жизни, новый этап, прорыв, бурный рост и развитие в какой-то сфере жизни",
    "Неожиданность, случайность",
    "Непостоянство"],
    ["Неудача, несчастливое стечение обстоятельств",
    "Неумение реализовать предоставленные судьбой возможности",
    "Азартные игры, проигрыш, невезение",
    "Непостоянство"],
    ["Познай свою судьбу и научись сам управлять ею"],
    ["Не будь фаталистом"]
    ]
    
# 11
Strength = [
    ["Сила"],
    ["Духовная любовь, терпение, внутренняя гармония и равновесие",
    "Сила воли, бесстрашие, могущество",
    "Готовность действовать, мощная внутренняя энергия",
    "Здоровье, огромные внутренние резервы организма"],
    ["Злоупотребление властью, деспотизм",
    "Отсутствие самоконтроля, неуравновешенность, душевный разлад",
    "Слабость, неуверенность в себе, настрой на поражение, подверженность чужим влияниям",
    "Невозможность справиться с ситуацией, неудачи"],
    ["Целиком посвятить себя любимому человеку, делу, новым ощущениям"],
    ["Не переоценивайте свои силы, не доводите дело до разрушительных последствий"]
    ]
    
# 12
Hanged_Man = [
    ["Повешенный "],
    ["Самопожертвование, самоотречение, самоограничение",
    "Отказ от каких-то благ или удобств ради достижения цели",
    "Принятие ситуации, смирение перед обстоятельствами",
    "Перемены, переходный период, испытания",
    "Обретение внутренней свободы"],
    ["Эгоизм, гордость, пренебрежение чужими интересами",
    "Стремление к материальным благам",
    "Застой в жизни, сопротивление переменам, пассивность, апатия",
    "Бесполезные жертвы"],
    ["Сменить точку зрения, чтобы понять кое-что"],
    ["Не стоит унывать, махать на себя рукой и цепляться за старое"]
    ]
    
# 13
Death = [
    ["Смерть"],
    ["Внутреннее изменение, возрождение, обновление",
    "Перемены к лучшему, новый этап в жизни",
    "Завершение какого-то большого дела или этапа в жизни"],
    ["Депрессия, пассивность, застой в жизни или в отношениях, сопротивление переменам",
    "Распад отношений, потеря, перемены к худшему",
    "Крушение планов и идеалов"],
    ["Отпустите от себя старое, дайте ему завершиться"],
    ["Не совершайте шагов, у которых нет будущего"]
    ]
    
# 14
Temperance = [
    ["Воздержание "],
    ["Необходимость регулировать желания и страсти, поддерживать гармонию в отношениях",
    "Терпимость, толерантность, готовность к компромиссам, дипломатичность",
    "Сотрудничество, возможность координировать действия или процессы",
    "Бережливость, разумная экономия"],
    ["Отсутствие самоконтроля, несдержанность, нетерпимость",
    "Проблемы в отношениях, разрыв связей между людьми, непостоянство",
    "Столкновение интересов, конкурентная борьба, не пройденное испытание",
    "Крайняя степень скупости или расточительства"],
    ["Найти верную меру и следовать ей"],
    ["Не допускайте халтуры и сиюминутных увлечений"]
    ]
    
# 15
Devil = [
    ["Дьявол"],
    ["Компромисс со своей совестью, возможность поддаться опасному соблазну",
    "Одержимость властью, материальными благами, пагубными желаниями, темными стороны натуры",
    "Отрицательные эмоции, гнев, разрушение, несчастья, трудности",
    "Зависимость от воли других людей или от обстоятельств"],
    ["Крайняя степень честолюбия, жестокость, злоупотребление властью, эгоизм",
    "Зацикленность на материальных благах",
    "Потеря контроля над ситуацией, полная зависимость от кого-либо или чего-либо, неправильный выбор",
    "Провал планов, резкие перемены к худшему, злой рок"],
    ["Внести луч света в царство тьмы"],
    ["Не поддавайтесь искушению изменить своим принципам, не запутывайтесь в отношениях с другими, не впутывайтесь в грязные дела и борьбу за власт"]
    ]
    
# 16
Tower = [
    ["Башня"],
    ["Несчастья, длительный период трудностей, позор",
    "Угнетение, полное подчинение кому-то, лишение свободы воли и свободы выбора, тюремное заключение",
    "Полное крушение всех планов",
    "Большие материальные, личные или духовные потери"],
    ["Неожиданные перемены к худшему, крушение планов, катастрофа",
    "Несчастья, позор, обман",
    "Материальные потери – деньги, имущество, работа и т.д",
    "Личные и духовные потери – разрыв отношений, тяжелая болезнь, крах идеалов"],
    ["Взломайте рамки, ставшие слишком тесными"],
    ["Избегайте неоправданного риска, будьте готовы к краху прежних представлений и надежд"]
    ]
    
# 17 
Star = [
    ["Звезда"],
    ["Перемены к лучшему, достижение, открывающиеся перспективы",
    "Неуклонное движение к своей цели, творческий подъем",
    "Здоровье, красота, физическое и духовное обновление, исцеление от болезней",
    "Гармония в душе, счастье, умиротворение"],
    ["Крушение планов и надежд, разочарование, бессилие",
    "Отсрочка счастливых событий, перенос их на неопределенный срок",
    "Неверие в собственные силы, пассивность, нежелание (или неумение) воспользоваться счастливыми шансами судьбы",
    "Нетерпение, замкнутость, душевный разлад"],
    ["Поверьте в свою удачу и в свое будущее"],
    ["Не увлекайтесь мечтами о будущем, чтобы не упустить сегодняшний шанс"]
    ]
    
# 18
Moon =[
    ["Луна "],
    ["Неверная оценка ситуации, упущение, информационная «брешь» в какой-то области",
    "Скрытая опасность, тайный враг, обман, опасность",
    "Переменчивость настроения, непостоянство чувств, ссоры и конфликты",
    "Непроявленная пока болезнь, ошибки",
    "Необъяснимые явления, обостренная интуиция, вещие сны"],
    ["Преодолейте свои страхи и перешагните порог неведомого"],
    ["Не блуждайте во тьме, не уходите в мир иллюзий и галлюцинаций, чтобы не оступиться перед порогом"]
    ]
    
# 19
Sun = [
    ["Солнце"],
    ["Избыток жизненной энергии, крепкое здоровье",
    "Уверенность в себе, большие возможности, материальное процветание",
    "Успех, радость, счастье",
    "Новые начинания: успешные проекты, захватывающие перспективы",
    "Счастливый брак, рождение ребенка, крепкие дружеские и родственные связи"],
    ["Хорошее здоровье, энергия для реализации задуманного",
    "Хорошее положение дел, успех, позитив, прогресс",
    "Излишняя самоуверенность",
    "Нетерпеливость, недостаток умеренности"],
    ["Беритесь за дело с оптимизмом и жизнерадостностью"],
    ["Не переоценивайте свои силы, не будьте наивны, банальны или легкомысленны"]
    ]
    
# 20
Judgement = [
    ["Суд"],
    ["Перемены в жизни, обновление, духовное перерождение",
    "Любые новые позитивные проекты и начинания (брак, рождение ребенка, новая работа, улучшение качества жизни)",
    "Прогресс, движение вперед, достижение результатов",
    "Хорошие новости"],
    ["Нерешительность, сопротивление переменам, чрезмерная осторожность, пагубный консерватизм",
    "Отсутствие прогресса в жизни, медлительность, отсрочка в достижении целей",
    "Страх, раскаяние, тюремное заключение, тяжелая болезнь"],
    ["Верьте, что решение проблемы или избавление не за горами"],
    ["Смотрите, чтобы старые проблемы, давно решенные и пройденные, не воскресли вновь"]
    ]
    
# 21
World = [
    ["Мир"],
    ["Успех, признание, триумф",
    "Заслуженная награда, плоды трудов, удачная реализация задуманного",
    "Мир и гармония в душе, честность, откровенность",
    "Спокойное (без потрясений) завершение одного этапа в жизни и начало нового",
    "Путешествия, общение, открытость миру и людям"],
    ["Неудачи, крушение планов",
    "Застой в делах, медлительность, отсрочка в достижении цели",
    "Разочарование, беспокойство, внутренний конфликт",
    "Возмездие, расплата за несправедливость в прошлом, сомнительная награда"],
    ["Найдите свое место и радуйтесь жизни"],
    ["Достигнув цели, не спешите почивать на лаврах"]
    ]


