# Срезы

print("Введите строку")
s = str( input())

# Третий символ строки
print("Третий символ строки", s[2])

# Предпоследний символ
print("Предпоследний символ", s[-2])

# Первые пять символов
print("Первые пять символов", s[:5])

# Кроме последних двух
print("Кроме последних двух", s[:-2])

# Все четные
print("Все четные", s[::2])

# Все нечетные
print("Все нечетные", s[1::2])

# Обратный порядок
print("В обратном порядке", s[::-1])

# В обратном порядке через 1
print("В обратном плрядке черех 1", s[::-2])

# Длина строки
print("Длина строки", len(s))





