# От матрицы смежности к списку ребер, неориентированный вариант

print("Введите количество вершиен в графе n=")
n = int( input())

a = [[0, 0, 1, 0, 0],
     [0, 0, 1, 0, 1], 
     [1, 1, 0, 0, 0], 
     [0, 0, 0, 0, 0], 
     [0, 1, 0, 0, 0]
    ]

b = []
r = [0, 0]
for i in range(n):
    for j in range(n):
        if j > i:
            if a[i][j] == 1:
                r = [0, 0]
                r[0] = i+1
                r[1] = j+1
                b.append(r)

for i in range(len(b)):
    print(b[i])


                